<center>
<h1>Факультет "Прикладная математика" МАИ</h1>
<h2>Курс "Основы Python для анализа данных"</h2>
<h2>Артамонов Игорь Михайлович</h2>
</center>

<center><h2>Занятие № 6. Введение в pandas.</h2></center>

## Общение / вопросы по курсу

Платформа для групповой работы Atlassian Confluence факультета "Прикладная математика"

https://mai.moscow/display/PYTML

* <b>Занятие 6. Введение в pandas.</b>
       * Серии (Series)
       * Датафрейм (DataFrame)

## virtualenv + Jupyter notebook

```
<Ctrl> + <Alt> + T - новое окно терминала
```

```
$ conda -V

$ conda update conda

$ conda search "^python$"

$ conda create -n yourenvname python=x.x anaconda

$ source activate yourenvname

$ jupyter notebook

$ conda install -n yourenvname [package]
```

# Общее

* pandas является одной из основных библиотек при работе с данными
* Основными типами данных pandas являются серия и датафрейм
* В основе этих элементов лежат массивы numpy, доступ к которым может быть легко полчен
* Сводить pandas к numpy __неверно__! pandas - __специализированная надстройка для работы с данными__, использующая массив только как эффективное средство для хранения данных и простых операций над ними
* С (очень) серьезными оговорками, pandas можно рассматривать как "сверхэффективный SQL таблицами в памяти"
* Важные функции pandas:
    - ввод / вывод
    - индексация
    - сортировка
    - работа с неполными и "грязными" данным
    - трансформация данных
    - объединение / разделение / комбинирование данных
    - агрегирование и групповые операции
    - кроме опреций ввода/вывода, pandas работает только с данными в памяти; это достаточно серьезное ограничение, следующее из его достоинств <br><br>
Импорт __pandas__ производится командой:

```python
    import pandas as pd
```

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as sc
%matplotlib inline

In [2]:
import os
import os.path

### Серия (Series)

* Серия - это данные, состоящие из одного столбца
* (на будущее) Один столбец датафрейма - это __серия__
* Работа с сериями и датафреймами __очень__ близка (можно что-то отладить на серии, как столбце, а потом применить к датафрейму)

In [3]:
sr = pd.Series([2, 7, 13, -6, -2, 17])
sr

0     2
1     7
2    13
3    -6
4    -2
5    17
dtype: int64

In [4]:
sr.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
type(sr.index)

pandas.core.indexes.range.RangeIndex

In [6]:
sr.values

array([ 2,  7, 13, -6, -2, 17])

In [7]:
type(sr.values)

numpy.ndarray

In [8]:
sr.values.shape

(6,)

In [9]:
sr.loc[2]

13

In [10]:
sr.iloc[2]

13

In [11]:
srn = pd.Series([ 2,  7, 13, -6, -2, 17], index=['d', 'b', 'a', 'b', 'k', 'r'])
srn

d     2
b     7
a    13
b    -6
k    -2
r    17
dtype: int64

In [12]:
srn.index

Index(['d', 'b', 'a', 'b', 'k', 'r'], dtype='object')

In [13]:
type(sr.index)

pandas.core.indexes.range.RangeIndex

In [14]:
srn.loc[['b','a']]

b     7
b    -6
a    13
dtype: int64

In [15]:
srn.loc[['b']]

b    7
b   -6
dtype: int64

In [16]:
# другая форма loc
srn[['b','a']]

b     7
b    -6
a    13
dtype: int64

In [ ]:
srn[['b','c']]

In [ ]:
srn.reindex(['b','c'])

In [19]:
'r' in srn

True

In [20]:
'z' in srn

False

In [21]:
sr[sr > 0]

0     2
1     7
2    13
5    17
dtype: int64

In [22]:
sr[sr < 0] * 2

3   -12
4    -4
dtype: int64

In [23]:
np.exp(srn)

d    7.389056e+00
b    1.096633e+03
a    4.424134e+05
b    2.478752e-03
k    1.353353e-01
r    2.415495e+07
dtype: float64

In [24]:
cit_dict = {
    'Москва':12506468,
    'Санкт-Петербург':5351935,
    'Новосибирск':1612833, 
    'Екатеринбург':1468833,
    'Нижний Новгород':1259013,
    'Казань':1243500,
    'Челябинск':1202371,
    'Омск':1172070,
    'Самара':1163399,
    'Ростов-на-Дону':1130305
}

In [25]:
cit = pd.Series(cit_dict)
cit

Москва             12506468
Санкт-Петербург     5351935
Новосибирск         1612833
Екатеринбург        1468833
Нижний Новгород     1259013
Казань              1243500
Челябинск           1202371
Омск                1172070
Самара              1163399
Ростов-на-Дону      1130305
dtype: int64

In [26]:
cities = list(cit_dict.keys()) + ['Уфа', 'Красноярск']

In [27]:
cities

['Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Нижний Новгород',
 'Казань',
 'Челябинск',
 'Омск',
 'Самара',
 'Ростов-на-Дону',
 'Уфа',
 'Красноярск']

In [28]:
cit2 = pd.Series(cit_dict, index=cities)
cit2

Москва             12506468.0
Санкт-Петербург     5351935.0
Новосибирск         1612833.0
Екатеринбург        1468833.0
Нижний Новгород     1259013.0
Казань              1243500.0
Челябинск           1202371.0
Омск                1172070.0
Самара              1163399.0
Ростов-на-Дону      1130305.0
Уфа                       NaN
Красноярск                NaN
dtype: float64

In [29]:
pd.isnull(cit2)

Москва             False
Санкт-Петербург    False
Новосибирск        False
Екатеринбург       False
Нижний Новгород    False
Казань             False
Челябинск          False
Омск               False
Самара             False
Ростов-на-Дону     False
Уфа                 True
Красноярск          True
dtype: bool

In [30]:
pd.notnull(cit2)

Москва              True
Санкт-Петербург     True
Новосибирск         True
Екатеринбург        True
Нижний Новгород     True
Казань              True
Челябинск           True
Омск                True
Самара              True
Ростов-на-Дону      True
Уфа                False
Красноярск         False
dtype: bool

In [31]:
cit + cit2

Екатеринбург        2937666.0
Казань              2487000.0
Красноярск                NaN
Москва             25012936.0
Нижний Новгород     2518026.0
Новосибирск         3225666.0
Омск                2344140.0
Ростов-на-Дону      2260610.0
Самара              2326798.0
Санкт-Петербург    10703870.0
Уфа                       NaN
Челябинск           2404742.0
dtype: float64

In [32]:
cit2.name = 'Население'
cit2.index.name = 'Город'
cit2

Город
Москва             12506468.0
Санкт-Петербург     5351935.0
Новосибирск         1612833.0
Екатеринбург        1468833.0
Нижний Новгород     1259013.0
Казань              1243500.0
Челябинск           1202371.0
Омск                1172070.0
Самара              1163399.0
Ростов-на-Дону      1130305.0
Уфа                       NaN
Красноярск                NaN
Name: Население, dtype: float64

### Датафрейм (DataFrame)

In [33]:
data = {'city': ['Москва','Санкт-Петербург','Новосибирск', 'Екатеринбург','Нижний Новгород', \
        'Казань', 'Челябинск', 'Омск', 'Самара', 'Ростов-на-Дону'],
        'year': [2010, 2012,2014,2016,2014,2016,2010,2013,2011,2016],
        'population': [12506468, 5351935, 1612833, 1468833, 1259013, 1243500, 1202371, 1172070, 1163399, 1130305]
       }

In [34]:
df = pd.DataFrame(data)

In [35]:
df

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833
3     Екатеринбург  2016     1468833
4  Нижний Новгород  2014     1259013
5           Казань  2016     1243500
6        Челябинск  2010     1202371
7             Омск  2013     1172070
8           Самара  2011     1163399
9   Ростов-на-Дону  2016     1130305

In [36]:
df.head(3)

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833

In [37]:
data1 = [{'city': 'Москва', 'year':2010, 'population':12506468 }, 
         {'city': 'Санкт-Петербург', 'year':2012,  'population':5351935 }, 
         {'city': 'Новосибирск', 'year':2014, 'population':1612833 }, 
         {'city': 'Екатеринбург', 'year':2016, 'population':1468833 }, 
         {'city': 'Нижний Новгород', 'year':2014, 'population':1259013 }, 
         {'city': 'Казань', 'year':2016, 'population':1243500 }, 
         {'city': 'Челябинск', 'year':2010, 'population':1202371 }, 
         {'city': 'Омск', 'year':2013, 'population':1172070 }, 
         {'city': 'Самара', 'year':2011, 'population':1163399 }, 
         {'city': 'Ростов-на-Дону', 'year':2016, 'population':1130305 }]

In [38]:
df1 = pd.DataFrame.from_dict(data1)
df1

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833
3     Екатеринбург  2016     1468833
4  Нижний Новгород  2014     1259013
5           Казань  2016     1243500
6        Челябинск  2010     1202371
7             Омск  2013     1172070
8           Самара  2011     1163399
9   Ростов-на-Дону  2016     1130305

In [39]:
df.tail(5)

             city  year  population
5          Казань  2016     1243500
6       Челябинск  2010     1202371
7            Омск  2013     1172070
8          Самара  2011     1163399
9  Ростов-на-Дону  2016     1130305

In [40]:
df_year = pd.DataFrame(df, columns=['year'])
df_year

   year
0  2010
1  2012
2  2014
3  2016
4  2014
5  2016
6  2010
7  2013
8  2011
9  2016

In [41]:
type(df_year)

pandas.core.frame.DataFrame

In [42]:
type(df['year'])

pandas.core.series.Series

In [43]:
df.city

0             Москва
1    Санкт-Петербург
2        Новосибирск
3       Екатеринбург
4    Нижний Новгород
5             Казань
6          Челябинск
7               Омск
8             Самара
9     Ростов-на-Дону
Name: city, dtype: object

In [44]:
df['city']

0             Москва
1    Санкт-Петербург
2        Новосибирск
3       Екатеринбург
4    Нижний Новгород
5             Казань
6          Челябинск
7               Омск
8             Самара
9     Ростов-на-Дону
Name: city, dtype: object

In [45]:
df[df['city'] == 'Москва']

     city  year  population
0  Москва  2010    12506468

In [46]:
df2 = pd.DataFrame(data, columns=['year', 'city', 'population', 'income'],
                      index=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'])

In [47]:
df2

    year             city  population income
1   2010           Москва    12506468    NaN
2   2012  Санкт-Петербург     5351935    NaN
3   2014      Новосибирск     1612833    NaN
4   2016     Екатеринбург     1468833    NaN
5   2014  Нижний Новгород     1259013    NaN
6   2016           Казань     1243500    NaN
7   2010        Челябинск     1202371    NaN
8   2013             Омск     1172070    NaN
9   2011           Самара     1163399    NaN
10  2016   Ростов-на-Дону     1130305    NaN

In [48]:
df2.loc['1']

year              2010
city            Москва
population    12506468
income             NaN
Name: 1, dtype: object

In [49]:
df2.income = 123.456
df2.income = df2.income.astype(int)

In [50]:
df2

    year             city  population  income
1   2010           Москва    12506468     123
2   2012  Санкт-Петербург     5351935     123
3   2014      Новосибирск     1612833     123
4   2016     Екатеринбург     1468833     123
5   2014  Нижний Новгород     1259013     123
6   2016           Казань     1243500     123
7   2010        Челябинск     1202371     123
8   2013             Омск     1172070     123
9   2011           Самара     1163399     123
10  2016   Ростов-на-Дону     1130305     123

In [51]:
df2.dtypes

year           int64
city          object
population     int64
income         int64
dtype: object

In [52]:
df.columns

Index(['city', 'year', 'population'], dtype='object')

In [53]:
df2.income = np.arange(100,200, 10)

In [54]:
df2

    year             city  population  income
1   2010           Москва    12506468     100
2   2012  Санкт-Петербург     5351935     110
3   2014      Новосибирск     1612833     120
4   2016     Екатеринбург     1468833     130
5   2014  Нижний Новгород     1259013     140
6   2016           Казань     1243500     150
7   2010        Челябинск     1202371     160
8   2013             Омск     1172070     170
9   2011           Самара     1163399     180
10  2016   Ростов-на-Дону     1130305     190

In [55]:
df2.dtypes

year           int64
city          object
population     int64
income         int64
dtype: object

In [56]:
df2 = pd.DataFrame(data, columns=['year', 'city', 'population', 'income'],
                      index=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'])

In [57]:
income = pd.Series([123,456,789,1010], index = ['1','2', '8', '11'])

In [58]:
df2['income'] = income

In [59]:
df2

    year             city  population  income
1   2010           Москва    12506468   123.0
2   2012  Санкт-Петербург     5351935   456.0
3   2014      Новосибирск     1612833     NaN
4   2016     Екатеринбург     1468833     NaN
5   2014  Нижний Новгород     1259013     NaN
6   2016           Казань     1243500     NaN
7   2010        Челябинск     1202371     NaN
8   2013             Омск     1172070   789.0
9   2011           Самара     1163399     NaN
10  2016   Ростов-на-Дону     1130305     NaN

In [60]:
df2['big'] = df2['population'] > 1500000

In [61]:
df2

    year             city  population  income    big
1   2010           Москва    12506468   123.0   True
2   2012  Санкт-Петербург     5351935   456.0   True
3   2014      Новосибирск     1612833     NaN   True
4   2016     Екатеринбург     1468833     NaN  False
5   2014  Нижний Новгород     1259013     NaN  False
6   2016           Казань     1243500     NaN  False
7   2010        Челябинск     1202371     NaN  False
8   2013             Омск     1172070   789.0  False
9   2011           Самара     1163399     NaN  False
10  2016   Ростов-на-Дону     1130305     NaN  False

In [62]:
del df2['big']
df2.columns

Index(['year', 'city', 'population', 'income'], dtype='object')

In [63]:
df.drop(columns=['big'], axis='columns')

KeyError: "['big'] not found in axis"

In [64]:
df.T

,0,1,2,3,4,5,6,7,8,9
city,Москва,Санкт-Петербург,Новосибирск,Екатеринбург,Нижний Новгород,Казань,Челябинск,Омск,Самара,Ростов-на-Дону
year,2010,2012,2014,2016,2014,2016,2010,2013,2011,2016
population,12506468,5351935,1612833,1468833,1259013,1243500,1202371,1172070,1163399,1130305

In [65]:
population = {'Москва': {2010: 11.4, 2011:11.9, 2013:12.1},
       'Новосибирск': {2010:1.5, 2012:1.7, 2013:3.6}}

In [66]:
df3 = pd.DataFrame(population)
df3

      Москва  Новосибирск
2010    11.4          1.5
2011    11.9          NaN
2013    12.1          3.6
2012     NaN          1.7

In [67]:
pd.DataFrame(population, index=[2010, 2011, 2012, 2013])

      Москва  Новосибирск
2010    11.4          1.5
2011    11.9          NaN
2012     NaN          1.7
2013    12.1          3.6

In [68]:
df.values

array([['Москва', 2010, 12506468],
       ['Санкт-Петербург', 2012, 5351935],
       ['Новосибирск', 2014, 1612833],
       ['Екатеринбург', 2016, 1468833],
       ['Нижний Новгород', 2014, 1259013],
       ['Казань', 2016, 1243500],
       ['Челябинск', 2010, 1202371],
       ['Омск', 2013, 1172070],
       ['Самара', 2011, 1163399],
       ['Ростов-на-Дону', 2016, 1130305]], dtype=object)

In [69]:
type(df.values)

numpy.ndarray

In [70]:
df.iloc[3,0:1] = 0
df

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833
3                0  2016     1468833
4  Нижний Новгород  2014     1259013
5           Казань  2016     1243500
6        Челябинск  2010     1202371
7             Омск  2013     1172070
8           Самара  2011     1163399
9   Ростов-на-Дону  2016     1130305

In [71]:
df = pd.DataFrame(population)
df

      Москва  Новосибирск
2010    11.4          1.5
2011    11.9          NaN
2013    12.1          3.6
2012     NaN          1.7

In [72]:
df.index.name = 'year'; 
df.columns.name = 'city'
df

city  Москва  Новосибирск
year
2010    11.4          1.5
2011    11.9          NaN
2013    12.1          3.6
2012     NaN          1.7

In [73]:
df.values

array([[11.4,  1.5],
       [11.9,  nan],
       [12.1,  3.6],
       [ nan,  1.7]])

### Индексы, как объекты

In [74]:
sr = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
index = sr.index
index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [75]:
index[1:3]

Index(['b', 'c'], dtype='object')

In [76]:
labels = pd.Index(np.arange(5))
labels
df2 = pd.Series([1.5, -2.5, 0, 14, -2.2], index=labels)
df2

0     1.5
1    -2.5
2     0.0
3    14.0
4    -2.2
dtype: float64

In [77]:
df2.index is labels

True

#### <font color='green'>Вопрос.</font>
Для чего нужна предыдущая команда? Проверка утверждения: Labels является ссылкой на тоже что и объект df2.index

In [78]:
df
df.columns

Index(['Москва', 'Новосибирск'], dtype='object', name='city')

In [79]:
'Москва' in df.columns

True

In [80]:
2003 in df.index

False

In [81]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### Ввод из файлов

In [82]:
!ls Lesson_06_files/*.xls

Lesson_06_files/ru-cities.xls

In [83]:
df = pd.read_excel('Lesson_06_files/ru-cities.xls',skiprows=8)

In [84]:
df.shape

(175, 6)

In [85]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,1.0,Москва,NaN,11514.3,5332.7,6181.6
1,2.0,Санкт-Петербург,NaN,4848.7,2209.6,2639.1
2,3.0,Новосибирск,Новосибирская область,1473.7,676.5,797.2
3,4.0,Екатеринбург,Свердловская область,1350.1,605.4,744.7
4,5.0,Нижний Новгород,Нижегородская область,1250.6,550.2,700.4

In [86]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,1.0,Москва,NaN,11514.3,5332.7,6181.6
1,2.0,Санкт-Петербург,NaN,4848.7,2209.6,2639.1
2,3.0,Новосибирск,Новосибирская область,1473.7,676.5,797.2
3,4.0,Екатеринбург,Свердловская область,1350.1,605.4,744.7
4,5.0,Нижний Новгород,Нижегородская область,1250.6,550.2,700.4

In [87]:
df.iloc[100]

Unnamed: 0                    17
Unnamed: 1                 Химки
Unnamed: 2    Московская область
Unnamed: 3                 207.1
Unnamed: 4                  94.6
Unnamed: 5                 112.5
Name: 100, dtype: object

In [88]:
df.to_csv('Lesson_06_files/ru-cities.csv')

In [89]:
!ls Lesson_06_files/*.csv

Lesson_06_files/ru-cities.csv

## <font color=red>ЗАДАНИЕ</font>

Определите:
* названия колонок и индекса
* переименуйте колонки и индексы любым удобным Вам способом
* найдите города с населением от 600 до 700 тысяч человек

In [90]:
df.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5'],
      dtype='object')

In [91]:
df.index

RangeIndex(start=0, stop=175, step=1)

In [92]:
df.columns = ['ID', 'City', 'State', 'Population(thsnds)', 'Male(thsnds)',
       'Female(thsnds)']
df.columns

Index(['ID', 'City', 'State', 'Population(thsnds)', 'Male(thsnds)',
       'Female(thsnds)'],
      dtype='object')

In [93]:
df.set_index('ID', inplace=True)
df.index

Float64Index([ 1.0,  2.0,  3.0,  4.0,  5.0,  6.0,  7.0,  8.0,  9.0, 10.0,
              ...
              82.0, 83.0, 84.0, 85.0, 86.0, 87.0, 88.0, 89.0, 90.0, 91.0],
             dtype='float64', name='ID', length=175)

In [94]:
df.head()

,City,State,Population(thsnds),Male(thsnds),Female(thsnds)
ID,,,,,
1.0,Москва,NaN,11514.3,5332.7,6181.6
2.0,Санкт-Петербург,NaN,4848.7,2209.6,2639.1
3.0,Новосибирск,Новосибирская область,1473.7,676.5,797.2
4.0,Екатеринбург,Свердловская область,1350.1,605.4,744.7
5.0,Нижний Новгород,Нижегородская область,1250.6,550.2,700.4

In [95]:
df[(df['Population(thsnds)'] >= 600) & (df['Population(thsnds)'] <= 700)]['City']

ID
7.0       Ижевск
8.0    Ульяновск
9.0      Барнаул
Name: City, dtype: object

## Дополнительная функциональность

### Реиндексация

In [96]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [97]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [98]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [99]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [100]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [101]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [102]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [ ]:
frame2[['a', 'b', 'c', 'd'], states]

### Удаление записей из оси

In [105]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [106]:
new_obj = obj.drop(['c','d'])
new_obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [107]:
obj.drop('c', inplace=True)

In [108]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop(['d', 'c'])

KeyError: "['c'] not found in axis"

In [110]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [113]:
data.drop('two', axis=1)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [114]:
data.drop('four', inplace=True)
data

KeyError: "['four'] not found in axis"

<b>ВОПРОС.</b> Что пошло не так?
axis = 0 (default) - по индексам 'four' нет

### Индексация, выбор и фильтрация

In [115]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [116]:
obj['c']

2.0

In [117]:
obj[2]

2.0

In [118]:
type(obj.index)

pandas.core.indexes.base.Index

In [119]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [120]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [121]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [122]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [123]:
obj[2:3]

c    2.0
dtype: float64

In [124]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [125]:
obj.iloc[2:3]

c    2.0
dtype: float64

In [126]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [127]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data['two'], type(data['two'])

(Ohio         1
 Colorado     5
 Utah         9
 New York    13
 Name: two, dtype: int64,
 pandas.core.series.Series)

In [129]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [130]:
print(data[:2])
data[data.three > 5]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
print(data < 5)
data[data < 5] = 0
data

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Выбор с loc и iloc

In [132]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [133]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [134]:
print(data.iloc[2])
data.iloc[[1, 2], [3, 0, 1]]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [135]:
print(data.loc[:'Utah', 'two'])
data.iloc[:, :3][data.three > 5]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Целочисленная индексация

In [136]:
ser = pd.Series(np.arange(3.)) 
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [137]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [138]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [139]:
print(ser[:1])
print(ser.loc[:1])
ser.iloc[:1]

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64

0    0.0
dtype: float64

### Арифметические операции

In [140]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [141]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [142]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [143]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [144]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [145]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [146]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [147]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [148]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [149]:
df1

   A
0  1
1  2

In [150]:
df2

   B
0  3
1  4

In [151]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Арифметические действия и заполнение

In [152]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [153]:
df2.loc[1, 'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [154]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [155]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [156]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [157]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [158]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [159]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Операции над датафреймами и сериями

In [160]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [161]:
arr[0]

array([0., 1., 2., 3.])

In [162]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

<b>ВОПРОС.</b> В чём отличие поведения от numpy.array? Необходимо совпадение названий по axis

In [163]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [164]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [165]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [166]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [167]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [168]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [169]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [170]:
frame.sub(series3, axis='columns')

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Применение функций и отображение

In [171]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.367958  0.777969  0.448378
Ohio    1.173254  0.259740  0.886393
Texas   0.574819 -0.887927  0.289771
Oregon  0.309782 -1.624532 -0.661491

In [172]:
np.abs(frame)

               b         d         e
Utah    0.367958  0.777969  0.448378
Ohio    1.173254  0.259740  0.886393
Texas   0.574819  0.887927  0.289771
Oregon  0.309782  1.624532  0.661491

In [173]:
f = lambda x: x.max() - x.min()
frame.apply(f,axis=0)

b    1.541212
d    2.402501
e    1.547884
dtype: float64

In [174]:
type(frame.apply(f,axis=0))

pandas.core.series.Series

In [175]:
frame.apply(f, axis='columns')

Utah      1.145927
Ohio      0.913514
Texas     1.462746
Oregon    1.934313
dtype: float64

In [176]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -0.367958 -1.624532 -0.661491
max  1.173254  0.777969  0.886393

In [177]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.37   0.78   0.45
Ohio     1.17   0.26   0.89
Texas    0.57  -0.89   0.29
Oregon   0.31  -1.62  -0.66

In [178]:
frame['e'].map(format)

Utah       0.45
Ohio       0.89
Texas      0.29
Oregon    -0.66
Name: e, dtype: object

## <font color=red>ЗАДАНИЕ</font>

Сделайте лямда-функцию, вычисляющую отклонения населения города РФ от среднего, 
и заполнящую этим значением новый столбец с именем 'Отклонение'

In [179]:
city_mean = np.mean(df['Population(thsnds)'])
city_mean

428.1103658536585

In [180]:
df['deviation'] = df.apply(lambda x: np.abs(x['Population(thsnds)'] - city_mean), axis = 1)
df

,City,State,Population(thsnds),Male(thsnds),Female(thsnds),deviation
ID,,,,,,
1.0,Москва,NaN,11514.3,5332.7,6181.6,11086.189634
2.0,Санкт-Петербург,NaN,4848.7,2209.6,2639.1,4420.589634
3.0,Новосибирск,Новосибирская область,1473.7,676.5,797.2,1045.589634
4.0,Екатеринбург,Свердловская область,1350.1,605.4,744.7,921.989634
5.0,Нижний Новгород,Нижегородская область,1250.6,550.2,700.4,822.489634
...,...,...,...,...,...,...
87.0,Междуреченск,Кемеровская область,102.0,47.5,54.5,326.110366
88.0,Ленинск-Кузнецкий,Кемеровская область,101.7,46.6,55.1,326.410366
89.0,Сарапул,Удмуртская Республика,101.4,45.2,56.2,326.710366
90.0,Ессентуки,Ставропольский край,101.0,45.1,55.9,327.110366
91.0,Воткинск,Удмуртская Республика,100.0,45.4,54.6,328.110366

### Сортировка и ранжирование

In [181]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [182]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [183]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [184]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [185]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [186]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [187]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [188]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [189]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [190]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [191]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [192]:
# Присвоение значений максимального ранга в группе
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [193]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [194]:
sr = pd.Series([10, 25, 3, 11, 24, 6, 25]) 
index_ = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp', 'Appy'] 
sr.index = index_ 
print(sr)

Coca Cola    10
Sprite       25
Coke          3
Fanta        11
Dew          24
ThumbsUp      6
Appy         25
dtype: int64

In [195]:
result = sr.rank() 
print(result)

Coca Cola    3.0
Sprite       6.5
Coke         1.0
Fanta        4.0
Dew          5.0
ThumbsUp     2.0
Appy         6.5
dtype: float64

### Индексация осей и дублирующиеся метки

In [196]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [197]:
obj.index.is_unique

False

In [198]:
obj['a'], obj['c']

(a    0
 a    1
 dtype: int64,
 4)

In [199]:
type(obj['a']), type(obj['c'])

(pandas.core.series.Series, numpy.int64)

In [200]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.060297  0.577860 -0.183778
a -0.725125  0.204891 -1.638726
b  0.263926 -0.187331  1.102609
b -0.521124  0.885018 -1.969220

In [201]:
df.loc['b']

          0         1         2
b  0.263926 -0.187331  1.102609
b -0.521124  0.885018 -1.969220

## Статистика и функции агрегирования

In [202]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [203]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [204]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [205]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [206]:
df.idxmax()

one    b
two    d
dtype: object

In [207]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [208]:
df.shape

(4, 2)

In [209]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [210]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Корреляция и ковариация

In [ ]:
#!conda install pandas-datareader
#!pip install pandas-datareader

In [211]:
price = pd.read_pickle('Lesson_06_files/yahoo_price.pkl')
volume = pd.read_pickle('Lesson_06_files/yahoo_volume.pkl')

In [212]:
import pandas_datareader.data as web

In [213]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [214]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [215]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-11-03  0.015354  0.011071  0.020264  0.014871
2020-11-04  0.040837 -0.019797  0.048249  0.059944
2020-11-05  0.035494  0.025648  0.031887  0.008141
2020-11-06 -0.001136 -0.006361  0.001926 -0.000919
2020-11-09 -0.000674  0.038520 -0.007733  0.015899

In [216]:
returns['MSFT'].corr(returns['IBM'])

0.5673752951303667

In [217]:
returns.MSFT.corr(returns.IBM)

0.5673752951303667

In [218]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.482997  0.718806  0.657729
IBM   0.482997  1.000000  0.567375  0.525718
MSFT  0.718806  0.567375  1.000000  0.780680
GOOG  0.657729  0.525718  0.780680  1.000000

In [219]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000361  0.000149  0.000239  0.000208
IBM   0.000149  0.000263  0.000161  0.000142
MSFT  0.000239  0.000161  0.000306  0.000228
GOOG  0.000208  0.000142  0.000228  0.000278

In [220]:
returns.corrwith(returns.IBM)

AAPL    0.482997
IBM     1.000000
MSFT    0.567375
GOOG    0.525718
dtype: float64

In [221]:
returns.corrwith(volume)

AAPL   -0.096158
IBM    -0.079908
MSFT   -0.094963
GOOG   -0.162521
dtype: float64

### Уникальные значения, подсчет значений и членство

In [222]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [223]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [224]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [225]:
pd.value_counts(obj.values, sort=False)

d    1
a    3
c    3
b    2
dtype: int64

In [226]:
obj
mask = obj.isin(['b', 'c'])
mask
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [227]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [228]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [229]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Экзаменационные вопросы:

* Серии и датафреймы pandas
* Индексация серий и датафреймов pandas
* Математические операции с сериями и датафреймами pandas